Repository: k-kukes/YumBurger
Catalog: yum_burger/lib/l10n/app_*.arb
Languages: fr

# hello
source: Welcome to Yum Burger!
fr: Bienvenue chez Yum Burger!

# greeting
source: Welcome to Yum Burger!
fr: Bienvenue chez Yum Burger!

# homeHeaderDescription
source: Order A YUM Combo Today!
fr: Commandez un YUM combo dès aujourd'hui!

# homeMenu
source: Check the menu
fr: Consultez le menu

# homeSignUp
source: Sign up
fr: Inscrivez-vous

# homeOfferTxt
source: Check out our latest offers! Save up some money for your next meal!
fr: Découvrez nos dernières offres! Économisez sur votre prochain repas!

# homeOfferBtn
source: Check Offers
fr: Consultez les offres

# homeOrderTxt
source: Try Out Our Yum Bacon Burger
fr: Essayez notre délicieux burger au bacon!

# homeOrderBtn
source: Order Now
fr: Commandez maintenant

# homeAboutTxt
source: Want to learn how we make our meals?
fr: Envie de savoir comment nous préparons nos plats?

# homeAboutBtn
source: About Us
fr: À propos de nous

# homeFaqTxt
source: Have any questions?
fr: Des questions?

# homeCreateTxt
source: Create your account and check out the latest promotions
fr: Créez votre compte et découvrez les dernières promotions

# aboutWelcome
source: Welcome to Yum Burger!
fr: Bienvenue chez Yum Burger!

# aboutTxt
source: At Yum Burger, we believe a great burger is more than just a meal, it’s an experience. Created with fresh ingredients and bold flavors, we serve handcrafted burgers made to satisfy every craving. From our delicious beef patties to our plant‑based creations, every bite is cooked with care and served with a smile. Whether you’re dining in, ordering online, or grabbing a quick bite on the go, Yum Burger is here to make your day better. We’re proud to be part of the community, offering friendly service, sustainable practices, and a menu that brings people together. So come hungry, leave happy, and remember: life’s too short for boring burgers!
fr: Chez Yum Burger, nous pensons qu'un bon burger est bien plus qu'un simple repas, c'est une expérience. Préparés avec des ingrédients frais et des saveurs audacieuses, nos hamburgers artisanaux sont conçus pour satisfaire toutes vos envies. From our delicious beef patties to our plant‑based creations, every bite is cooked with care and served with a smile. Que vous mangiez sur place, commandiez en ligne ou preniez un repas rapide sur le pouce, Yum Burger est là pour égayer votre journée. Nous sommes fiers de faire partie de la communauté, d'offrir un service convivial, des pratiques durables et un menu qui rassemble les gens. Alors venez affamés, repartez heureux, et souvenez-vous : la vie est trop courte pour des hamburgers ennuyeux!

source: Account Info
fr: Informations du compte

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: Full Name
fr: Nom complet

source: Email
fr: Adresse courriel

source: Settings
fr: Paramètres

# adminHomeHamburgers
source: Hamburgers
fr: Burgers

# adminHomeRevenue
source: Revenue
fr: Revenus

# adminHomeCustomers
source: Customers
fr: Clients

# adminHomeDrinks
source: Drinks
fr: Boissons

# adminOrdersTitle
source: All Orders
fr: Toutes les commandes

# adminOrdersNoOrders
source: No orders yet sorry.
fr: Aucune commande pour le moment.

# adminOrdersOrderNum
source: Order #
fr: Commande #

source: Add Burger
fr: Ajouter un burger

source: No data
fr: Aucune donnée

source: Price:
fr: Prix :

# deletedBurger
source: Burger was successfully deleted!
fr: Burger supprimé avec succès!

source: Burger Name
fr: Nom du burger

source: Burger Price
fr: Prix du burger

source: Burger Description
fr: Description du burger

source: Pick Image
fr: Choisir une image

source: No image
fr: Aucune image

source: Cancel
fr: Annuler

# fillFields
source: Please fill out all the fields!
fr: Veuillez remplir tous les champs!

# addedBurger
source: Burger added successfully
fr: Burger ajouté avec succès!

source: Edit Burger
fr: Modifier le burger

# editedBurger
source: Burger edited successfully
fr: Burger modifié avec succès!

# save
source: Save Changes
fr: Enregistrer les modifications

source: Drinks
fr: Boissons

source: Add Drink
fr: Ajouter une boisson

# deletedDrink
source: Drink was successfully deleted!
fr: Boisson supprimée avec succès!

source: Drink Name
fr: Nom de la boisson

source: Drink Price
fr: Prix de la boisson

source: Drink Description
fr: Description de la boisson

# drinkAdded
source: Drink added successfully!
fr: Boisson ajoutée avec succès!

source: Edit Drink
fr: Modifier la boisson

# editedDrink
source: Drink edited successfully
fr: Boisson modifiée avec succès

source: MY CART
fr: MON PANIER

# mustLogin
source: You must log in to access cart
fr: Vous devez vous connecter pour accéder à votre panier

# cartEmpty
source: Your cart is empty
fr: Votre panier est vide

source: Subtotal:
fr: Sous-total:

source: Delivery fee:
fr: Frais de livraison:

source: Tax:
fr: Taxe:

# noBuy
source: Why you don't buy anything
fr: Pourquoi n'avez-vous rien acheté ?

source: ORDER
fr: COMMANDER

source: error
fr: erreur

source: Go back home
fr: Retour à l'accueil

source: Create Account
fr: Créer un compte

# alreadyHaveAccount
source: Already have an account?
fr: Vous avez déjà un compte ?

source: Login
fr: Se connecter

# qOne
source: What are your opening hours?
fr: Quels sont vos horaires d'ouverture ?

# aOne
source: We’re open Monday to Sunday from 11:00 AM to 11:00 PM.
fr: Nous sommes ouverts du lundi au dimanche de 11h00 à 23h00.

# qTwo
source: Do you offer online ordering?
fr: Proposez-vous la commande en ligne?

# aTwo
source: Yes! You can order directly through our website or mobile app for pickup or delivery.
fr: Oui ! Vous pouvez commander directement via notre site web ou notre application mobile pour un retrait en magasin ou une livraison.

# qThree
source: Are vegetarian or vegan options available?
fr: Des options végétariennes ou végétaliennes sont-elles disponibles ?

# aThree
source: Absolutely. We have veggie burgers and plant-based patties!
fr: Absolument. Nous avons des burgers végétariens et des galettes végétales!

# qFour
source: Do you deliver?
fr: Vous effectuez des livraisons?

# aFour
source: Yes, we deliver through partners like Uber Eats and DoorDash.
fr: Oui, nous effectuons des livraisons via des partenaires comme Uber Eats et DoorDash.

# qFive
source: How can I contact customer support?
fr: Comment puis-je contacter le service client?

# aFive
source: You can call us at (555) 123‑4567.
fr: Vous pouvez nous appeler au (555) 123‑4567.

# qSix
source: Do you have loyalty rewards?
fr: Proposez-vous des programmes de fidélité?

# aSix
source: Yes, sign up for our rewards program to earn points on every purchase.
fr: Oui, inscrivez-vous à notre programme de fidélité pour gagner des points à chaque achat.

source: Reset password
fr: Réinitialiser le mot de passe

source: Success Login
fr: Connexion réussie

source: Failed Login
fr: Échec de la connexion

# notMember
source: Not a member?
fr: Pas encore un/une membre?

source: Food
fr: Nourriture

# errorAddToCart
source: Error while adding to cart!
fr: Erreur lors de l'ajout au panier!

# successAddToCart
source: Successfully added item to cart!
fr: Article ajouté au panier avec succès!

# mustLoginToCart
source: You must log in to add to cart!
fr: Vous devez vous connecter pour ajouter au panier!

source: Add
fr: Ajouter

# mustLoginOrders
source: You must be logged in to view your orders.
fr: Vous devez être connecté pour consulter vos commandes.

# emptyOrders
source: Orders Empty. Make your first order!
fr: Commandes vides. Passez votre première commande!

source: Loading...
fr: Chargement en cours...

# noOrders
source: No orders yet.
fr: Aucune commande pour le moment.

# madePurchase
source: You recently made a purchase of
fr: Vous avez récemment effectué un achat de

# paymentSuccess
source: Payment Successful!
fr: Paiement réussi!

source: You paid
fr: Vous avez payé

# earnedPts
source: and earned points!
fr: et gagné des points!

# ty
source: Thank you
fr: Merci

# paymentDecline
source: Payment Declined. Check Card # (16) or Expiry (MM/YY).
fr: Paiement refusé. Vérifiez le numéro de carte (16) ou la date d'expiration (MM/AA)

source: Secure Checkout
fr: Paiement sécurisé

# cardNum
source: Card Number
fr: Numéro de carte

# expDate
source: Expiry Date
fr: Date d'expiration

# confPayment
source: Confirm Payment
fr: Confirmer le paiement

# passNoMatch
source: Confirm Password and Password don't match
fr: Le confirmation de mot de passe et le mot de passe ne correspondent pas.

# passResetSuccess
source: Password reset successfully!
fr: Mot de passe réinitialisé avec succès !

# usernameNoExist
source: Username does not exist!
fr: Nom d'utilisateur inexistant!

# errorResetPass
source: Error resetting password!
fr: Erreur lors de la réinitialisation du mot de passe!

# confPass
source: Confirm Password
fr: Confirmer le mot de passe.

# rememberPass
source: Remember the password?
fr: Vous souvenez du mot de passe?

source: Go to Login
fr: Accéder à la page de connexion

source: Customer Reviews
fr: Avis clients

# noLoadReviews
source: Could not load reviews.
fr: Impossible de charger les avis.

source: Try Again
fr: Réessayer.

# noFoundReviews
source: No reviews found.
fr: Aucun avis trouvé.

# priceError
source: Price has to be a number value
fr: Le prix doit être une valeur numérique
